      ******************************************************************
      * Author: Erick Stiven Fierro Perdomo                            *
      * Date: 29/10/2023                                               *
      * Purpose:                                                       *
      * Tectonics: cobc                                                *
      ******************************************************************
      * CONTROL DE CAMBIOS: Creacion del programa                      *
      *              FECHA: 29/10/2023                                 *
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANCO-PROJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello  World"

           STOP RUN.

       END PROGRAM BANCO-PROJECT.
