      ******************************************************************
      * Author: Erick Stiven Fierro Perdomo                            *
      * Date: 30/10/2023                                               *
      * Purpose:                                                       *
      * Tectonics: cobc                                                *
      ******************************************************************
      * CONTROL DE CAMBIOS: Creacion del programa                      *
      *              FECHA: 30/10/2023                                 *
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GESTION-CLIENTES.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 1000-INICIO-PROGRAMA
           PERFORM 2000-PROCESO-PROGRAMA
           PERFORM 3000-FINAL-PROGRAMA.

       1000-INICIO-PROGRAMA.
           .

       2000-PROCESO-PROGRAMA.
           .

       3000-FINAL-PROGRAMA.
           STOP RUN
           .

       END PROGRAM GESTION-CLIENTES.
